bit-finance/Reports/бит_ПроверкаСпособаКомпоновкиИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ПроверкаСпособаКомпоновкиИсточников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособКомпоновки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СпособыКомпоновкиИсточниковДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПулаПодключений</Name>
					<Comment>Настройка пула подключений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_НастройкиПуловПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Comment>Период</Comment>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
					<Comment>Настройка периода</Comment>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементДанных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЭлементыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/Reports/бит_ПроверкаСпособаКомпоновкиИсточников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область СлужебныйПрограммныйИнтерфейс
			
// Процедура выполняет проверку формирования отчета.
// 
// Параметры:
//  ТД  			 - ТабличныйДокумент - первоначальный табличный документ.
//  ТД_Свернуто  	 - ТабличныйДокумент - свернутый табличный документ.
//  ОтборВОтчете 	 - Структура - структура отбораю
//  ТаблицаПараметры - ТаблицаЗначений - таблица параметров.
// 
Процедура ВыполнитьПроверку(ТД, ТД_Свернуто, ОтборВОтчете, ТаблицаПараметры) Экспорт

	ГраницаНач = Период.ДатаНачала;
	ГраницаКон = Новый Граница(Период.ДатаОкончания, ВидГраницы.Включая);
	
	СтруктураПараметров = бит_МеханизмПолученияДанных.ЗаполнитьСтруктуруПараметровИзТаблицы(ТаблицаПараметры);
	
	СтрОбъект = Новый Структура;
	СтрОбъект.Вставить("ВалютаДокумента"   ,Константы.ВалютаРегламентированногоУчета.Получить());
	СтрОбъект.Вставить("КурсДокумента"     ,1);
	СтрОбъект.Вставить("КратностьДокумента",1);
	СтрОбъект.Вставить("ДатаОкончания"     ,Период.ДатаОкончания);
	
	бит_МеханизмПолученияДанных.ДобавитьОбязательныеПараметрыПроизвольногоОтчета(СтрОбъект,СтруктураПараметров);
	
	Если ТипЗнч(СпособКомпоновки) = Тип("СправочникСсылка.бит_ИсточникиДанных") Тогда
		
		ТД.Очистить();					
		ТД.ТолькоПросмотр = Истина;
		
		Если Не ЗначениеЗаполнено(СпособКомпоновки) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен источник данных';en='Data source is empty'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		СтрПар = бит_МеханизмПолученияДанных.НовыепараметрыПолучитьДанныеПоИсточнику();
		СтрПар.Параметры                = СтруктураПараметров;
		СтрПар.ОтборВОтчете             = ОтборВОтчете;
		СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;
		
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточнику(СпособКомпоновки
																				,ГраницаНач
																				,ГраницаКон
																				,СтрПар);
		
		
		Макет = ПолучитьМакет("Макет");
		ВывестиТЗ(ТД,Макет,ТаблицаРезультат);
		
	ИначеЕсли ТипЗнч(СпособКомпоновки) = Тип("СправочникСсылка.бит_СпособыКомпоновкиИсточниковДанных") Тогда
		
		МассивЭлементов = ЭлементыДанных.ВыгрузитьКолонку("ЭлементДанных");
		Если МассивЭлементов.Количество()=0 Тогда
			МассивЭлементов = Неопределено;
		КонецЕсли; 
		
		ПоказыватьИндикатор = Не бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("НеОтображатьИндикаторКомпоновкиИсточников",
								Пользователи.ТекущийПользователь());
								
			Если Не ЗначениеЗаполнено(СпособКомпоновки) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен способ компоновки';en='Arrangement method is empty'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;

		СтрПар = бит_МеханизмПолученияДанных.НовыеПараметрыПолучитьДанныеПоСпособуКомпоновки();
		СтрПар.Параметры                = СтруктураПараметров;
		СтрПар.МассивЭлементов          = МассивЭлементов;
		СтрПар.ОтборВОтчете             = ОтборВОтчете;
		СтрПар.ПоказыватьИндикатор      = ПоказыватьИндикатор;
		СтрПар.НастройкаПулаПодключений = НастройкаПулаПодключений;
		
		//ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникам(СпособКомпоновки
		//																	,ГраницаНач
		//																	,ГраницаКон
		//																	,СтрПар);
		// ++ NB  
		ТаблицаРезультат = бит_МеханизмПолученияДанных.ПолучитьДанныеПоИсточникамМП(СпособКомпоновки
																			,ГраницаНач
																			,ГраницаКон
																			,СтрПар);
																	
		бит_МеханизмПолученияДанных.ДополнитьРезультатИВыполнитьРасчет(СпособКомпоновки,ТаблицаРезультат);
																			
		ТД.Очистить();					
		ТД.ТолькоПросмотр = Истина;
		Макет = ПолучитьМакет("Макет");
		ВывестиТЗ(ТД,Макет,ТаблицаРезультат);
		
		
		МассивРесурсов   = бит_МеханизмПолученияДанныхКлиентСервер.ПоляДляСпособаКомпоновки(СпособКомпоновки,"Ресурс");
		ТаблицаРезультат = бит_МеханизмПолученияДанных.СвернутьРезультат(ТаблицаРезультат,МассивРесурсов);
		
		ТД_Свернуто.Очистить();					
		ТД_Свернуто.ТолькоПросмотр = Истина;
		Макет = ПолучитьМакет("Макет");
		ВывестиТЗ(ТД_Свернуто,Макет,ТаблицаРезультат);
		
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выводит табличный документ.
// 
// Параметры:
//  ТД    - ТабличныйДокумент - первоначальный табличный документ.
//  Макет.
//  ТЗ.
// 
Процедура ВывестиТЗ(ТД, Макет, ТЗ)

	Если ТипЗнч(ТЗ) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ОблМакета = Макет.ПолучитьОбласть("Шапка|Начало");	
	ТД.Вывести(ОблМакета);
	ОблМакета = Макет.ПолучитьОбласть("Шапка|Колонка");
	Для каждого Колонка Из ТЗ.Колонки Цикл
		
		ОблМакета.Параметры.ИмяПоказателя = Колонка.Имя;
		ТД.Присоединить(ОблМакета);
		
	КонецЦикла; 
	
	ОблНачало  =   Макет.ПолучитьОбласть("Строка|Начало");
	ОблМакета  =   Макет.ПолучитьОбласть("Строка|Колонка");
	
	Для каждого СтрокаТаблицы Из ТЗ Цикл
		
		ТД.Вывести(ОблНачало);
		
		
		Для каждого Колонка Из ТЗ.Колонки Цикл
			
			ТекЗначение = СтрокаТаблицы[Колонка.Имя];
			Если ТипЗнч(ТекЗначение) = Тип("Структура") Тогда
				
				ОблМакета.Параметры.ЗначениеПоказателя  = ТекЗначение.Представление;
				ОблМакета.Параметры.ЗначениеРасшифровки = ТекЗначение;
				
			Иначе	
				
				ОблМакета.Параметры.ЗначениеПоказателя = ТекЗначение;
				ОблМакета.Параметры.ЗначениеРасшифровки= ТекЗначение; 
				
			КонецЕсли; 
			ТД.Присоединить(ОблМакета);
			
		КонецЦикла; 
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
